# Dev tools
brew "neovim"
brew "tmux"
brew "powerlevel10k"
brew "go"
brew "the_silver_searcher"
brew "fzf"
brew "zoxide"
brew "cmake"
brew "ninja" # Small build system for use with gyp or CMake
brew "dfu-util" # USB Programmer
brew "protobuf"
brew "python@3.10"
brew "git"
brew "wget"
brew "cloudflared"
brew "ollama"
cask "ghostty"
brew "node"
brew "podman"
brew "direnv"
brew "ansible"
brew "watch"

# Other apps
cask "firefox"
cask "spotify"
cask "google-chrome"
cask "proton-pass"
cask "discord"
cask "zoom"
